{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "ImageInput"}, "name": "ImageInput", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_1", "inbound_nodes": [[["ImageInput", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv1_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_2", "inbound_nodes": [[["Conv1_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool1", "inbound_nodes": [[["Conv1_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "Conv2_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 10}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "Conv2_1", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "Conv2_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 15}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "Conv2_2", "inbound_nodes": [[["Conv2_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool2", "inbound_nodes": [[["Conv2_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "Conv3_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 21}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "Conv3_1", "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1", "inbound_nodes": [[["Conv3_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "Conv3_2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 31}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "Conv3_2", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2", "inbound_nodes": [[["Conv3_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "Conv3_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 41}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "Conv3_3", "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool3", "inbound_nodes": [[["Conv3_3", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "Conv4_1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 47}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "Conv4_1", "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3", "inbound_nodes": [[["Conv4_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "Conv4_2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 57}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "Conv4_2", "inbound_nodes": [[["bn3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4", "inbound_nodes": [[["Conv4_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "Conv4_3", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 67}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "Conv4_3", "inbound_nodes": [[["bn4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool4", "inbound_nodes": [[["Conv4_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["pool4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc1", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout1", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}, "name": "dropout1", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc2", "inbound_nodes": [[["dropout1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout2", "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc3", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc3", "inbound_nodes": [[["dropout2", 0, 0, {}]]]}], "input_layers": [["ImageInput", 0, 0]], "output_layers": [["fc3", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 1e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of100.bin", "group1-shard2of100.bin", "group1-shard3of100.bin", "group1-shard4of100.bin", "group1-shard5of100.bin", "group1-shard6of100.bin", "group1-shard7of100.bin", "group1-shard8of100.bin", "group1-shard9of100.bin", "group1-shard10of100.bin", "group1-shard11of100.bin", "group1-shard12of100.bin", "group1-shard13of100.bin", "group1-shard14of100.bin", "group1-shard15of100.bin", "group1-shard16of100.bin", "group1-shard17of100.bin", "group1-shard18of100.bin", "group1-shard19of100.bin", "group1-shard20of100.bin", "group1-shard21of100.bin", "group1-shard22of100.bin", "group1-shard23of100.bin", "group1-shard24of100.bin", "group1-shard25of100.bin", "group1-shard26of100.bin", "group1-shard27of100.bin", "group1-shard28of100.bin", "group1-shard29of100.bin", "group1-shard30of100.bin", "group1-shard31of100.bin", "group1-shard32of100.bin", "group1-shard33of100.bin", "group1-shard34of100.bin", "group1-shard35of100.bin", "group1-shard36of100.bin", "group1-shard37of100.bin", "group1-shard38of100.bin", "group1-shard39of100.bin", "group1-shard40of100.bin", "group1-shard41of100.bin", "group1-shard42of100.bin", "group1-shard43of100.bin", "group1-shard44of100.bin", "group1-shard45of100.bin", "group1-shard46of100.bin", "group1-shard47of100.bin", "group1-shard48of100.bin", "group1-shard49of100.bin", "group1-shard50of100.bin", "group1-shard51of100.bin", "group1-shard52of100.bin", "group1-shard53of100.bin", "group1-shard54of100.bin", "group1-shard55of100.bin", "group1-shard56of100.bin", "group1-shard57of100.bin", "group1-shard58of100.bin", "group1-shard59of100.bin", "group1-shard60of100.bin", "group1-shard61of100.bin", "group1-shard62of100.bin", "group1-shard63of100.bin", "group1-shard64of100.bin", "group1-shard65of100.bin", "group1-shard66of100.bin", "group1-shard67of100.bin", "group1-shard68of100.bin", "group1-shard69of100.bin", "group1-shard70of100.bin", "group1-shard71of100.bin", "group1-shard72of100.bin", "group1-shard73of100.bin", "group1-shard74of100.bin", "group1-shard75of100.bin", "group1-shard76of100.bin", "group1-shard77of100.bin", "group1-shard78of100.bin", "group1-shard79of100.bin", "group1-shard80of100.bin", "group1-shard81of100.bin", "group1-shard82of100.bin", "group1-shard83of100.bin", "group1-shard84of100.bin", "group1-shard85of100.bin", "group1-shard86of100.bin", "group1-shard87of100.bin", "group1-shard88of100.bin", "group1-shard89of100.bin", "group1-shard90of100.bin", "group1-shard91of100.bin", "group1-shard92of100.bin", "group1-shard93of100.bin", "group1-shard94of100.bin", "group1-shard95of100.bin", "group1-shard96of100.bin", "group1-shard97of100.bin", "group1-shard98of100.bin", "group1-shard99of100.bin", "group1-shard100of100.bin"], "weights": [{"name": "Conv1_1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "Conv1_1/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv1_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Conv1_2/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv2_1/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "Conv2_1/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "Conv2_1/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv2_2/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "Conv2_2/pointwise_kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "Conv2_2/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv3_1/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "Conv3_1/pointwise_kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "Conv3_1/bias", "shape": [256], "dtype": "float32"}, {"name": "Conv3_2/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "Conv3_2/pointwise_kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "Conv3_2/bias", "shape": [256], "dtype": "float32"}, {"name": "Conv3_3/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "Conv3_3/pointwise_kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "Conv3_3/bias", "shape": [256], "dtype": "float32"}, {"name": "Conv4_1/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "Conv4_1/pointwise_kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "Conv4_1/bias", "shape": [512], "dtype": "float32"}, {"name": "Conv4_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "Conv4_2/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "Conv4_2/bias", "shape": [512], "dtype": "float32"}, {"name": "Conv4_3/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "Conv4_3/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "Conv4_3/bias", "shape": [512], "dtype": "float32"}, {"name": "bn1/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn1/beta", "shape": [256], "dtype": "float32"}, {"name": "bn1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "bn2/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "bn3/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn4/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn4/beta", "shape": [512], "dtype": "float32"}, {"name": "bn4/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn4/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "fc1/kernel", "shape": [100352, 1024], "dtype": "float32"}, {"name": "fc1/bias", "shape": [1024], "dtype": "float32"}, {"name": "fc2/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "fc3/kernel", "shape": [512, 5], "dtype": "float32"}, {"name": "fc3/bias", "shape": [5], "dtype": "float32"}]}]}